Revit 2024 API
BuiltInFailures.SketchFailures.SketchTooLarge Property
 Sketch is too large.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchTooLarge { get; }
Visual Basic
Public Shared ReadOnly Property SketchTooLarge As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchTooLarge {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace